Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Warm-up & Baseline Phase"
    - duration: 120
      arrivalRate: 100
      name: "Sustained Peak Load (100 RPS)"
    - duration: 30
      arrivalRate: 500
      name: "Spike Test Phase"
  defaults:
    headers:
      User-Agent: "Artillery-Load-Tester/2.0"
      Accept: "application/json"

scenarios:
  - name: "Farmer Market Browsing Flow"
    flow:
      - get:
          url: "/index.html"
      - think: 2
      - get:
          url: "/api/v1/market/commodities"
      - think: 1
      - get:
          url: "/api/v1/marketplace/listings"

  - name: "AI Price Prediction Request Flow"
    flow:
      - post:
          url: "/api/v1/predict/price"
          json:
            commodity: "rice"
            mandi: "delhi"
            days: 30
